Repository: AstraidLabs/AstraId
Catalog: src/AuthServer/Resources/Localization/AuthMessages.*.resx
Languages: cs_cz, de_de, pl_pl, sk_sk

# Auth.Login.Failed
source: Sign-in failed
cs_cz: Přihlášení se nezdařilo
de_de: Anmeldung fehlgeschlagen
pl_pl: Logowanie nie powiodło się
sk_sk: Prihlásenie zlyhalo

# Auth.Login.Failed.Detail
source: The email/username or password is incorrect.
cs_cz: E-mail/uživatelské jméno nebo heslo je nesprávné.
de_de: E-Mail/Benutzername oder Passwort ist falsch.
pl_pl: Nieprawidłowy e-mail/nazwa użytkownika lub hasło.
sk_sk: E-mail/používateľské meno alebo heslo je nesprávne.

# Auth.Login.LockedOut
source: Account locked
cs_cz: Účet je uzamčen
de_de: Konto gesperrt
pl_pl: Konto zablokowane
sk_sk: Účet je uzamknutý

# Auth.Login.LockedOut.Detail
source: Your account is temporarily locked due to too many failed attempts. Please try again later or reset your password.
cs_cz: Váš účet je dočasně uzamčen kvůli příliš mnoha pokusům. Zkuste to později nebo obnovte heslo.
de_de: Ihr Konto ist aufgrund zu vieler Fehlversuche vorübergehend gesperrt. Bitte versuchen Sie es später erneut oder setzen Sie Ihr Passwort zurück.
pl_pl: Twoje konto zostało tymczasowo zablokowane z powodu zbyt wielu prób. Spróbuj ponownie później lub zresetuj hasło.
sk_sk: Váš účet je dočasne uzamknutý kvôli príliš veľa pokusom. Skúste to neskôr alebo obnovte heslo.

# Auth.Login.EmailNotVerified
source: Email not verified
cs_cz: E-mail není ověřen
de_de: E-Mail nicht bestätigt
pl_pl: E-mail niezweryfikowany
sk_sk: E-mail nie je overený

# Auth.Login.EmailNotVerified.Detail
source: Please verify your email address before signing in. If you didn't receive the email, you can request a new verification link.
cs_cz: Před přihlášením ověřte svůj e-mail. Pokud jste zprávu neobdrželi, můžete požádat o nový ověřovací odkaz.
de_de: Bitte bestätigen Sie Ihre E-Mail-Adresse vor der Anmeldung. Wenn Sie keine E-Mail erhalten haben, können Sie einen neuen Bestätigungslink anfordern.
pl_pl: Zweryfikuj adres e-mail przed zalogowaniem. Jeśli nie otrzymałeś wiadomości, poproś o nowy link weryfikacyjny.
sk_sk: Pred prihlásením overte svoj e-mail. Ak ste správu nedostali, požiadajte o nový overovací odkaz.

# Auth.Login.Unavailable
source: Sign-in unavailable
cs_cz: Přihlášení není dostupné
de_de: Anmeldung nicht verfügbar
pl_pl: Logowanie niedostępne
sk_sk: Prihlásenie nie je dostupné

# Auth.Login.Unavailable.Detail
source: Sign-in is temporarily unavailable. Please try again later.
cs_cz: Přihlášení je dočasně nedostupné. Zkuste to prosím později.
de_de: Die Anmeldung ist vorübergehend nicht verfügbar. Bitte versuchen Sie es später erneut.
pl_pl: Logowanie jest tymczasowo niedostępne. Spróbuj ponownie później.
sk_sk: Prihlásenie je dočasne nedostupné. Skúste to neskôr.

# Auth.Register.Invalid
source: Registration failed
cs_cz: Registrace se nezdařila
de_de: Registrierung fehlgeschlagen
pl_pl: Rejestracja nie powiodła się
sk_sk: Registrácia zlyhala

# Auth.Register.Invalid.Detail
source: Registration failed.
cs_cz: Registrace se nezdařila.
de_de: Registrierung fehlgeschlagen.
pl_pl: Rejestracja nie powiodła się.
sk_sk: Registrácia zlyhala.

# Auth.Reset.InvalidLink
source: Invalid reset link
cs_cz: Neplatný odkaz pro obnovení
de_de: Ungültiger Link zum Zurücksetzen
pl_pl: Nieprawidłowy link resetujący
sk_sk: Neplatný odkaz na obnovenie

# Auth.Reset.InvalidLink.Detail
source: This password reset link is invalid or has expired. Please request a new one.
cs_cz: Odkaz pro obnovení hesla je neplatný nebo vypršel. Požádejte o nový.
de_de: Dieser Link zum Zurücksetzen ist ungültig oder abgelaufen. Fordern Sie einen neuen Link an.
pl_pl: Link resetujący hasło jest nieprawidłowy lub wygasł. Poproś o nowy.
sk_sk: Odkaz na obnovenie hesla je neplatný alebo vypršal. Požiadajte o nový.

# Auth.Reset.Forgot.Generic
source: If an account exists for this email, youâ€™ll receive a password reset link shortly.
cs_cz: Pokud účet pro tento e-mail existuje, brzy obdržíte odkaz pro obnovení hesla.
de_de: Wenn ein Konto für diese E-Mail existiert, erhalten Sie in Kürze einen Link zum Zurücksetzen des Passworts.
pl_pl: Jeśli konto dla tego adresu istnieje, wkrótce otrzymasz link do resetu hasła.
sk_sk: Ak účet pre tento e-mail existuje, čoskoro dostanete odkaz na obnovenie hesla.

# Auth.Activation.InvalidLink
source: Invalid verification link
cs_cz: Neplatný ověřovací odkaz
de_de: Ungültiger Bestätigungslink
pl_pl: Nieprawidłowy link weryfikacyjny
sk_sk: Neplatný overovací odkaz

# Auth.Activation.InvalidLink.Detail
source: This verification link is invalid or has expired. Please request a new one.
cs_cz: Tento ověřovací odkaz je neplatný nebo vypršel. Požádejte o nový.
de_de: Dieser Bestätigungslink ist ungültig oder abgelaufen. Fordern Sie einen neuen an.
pl_pl: Ten link weryfikacyjny jest nieprawidłowy lub wygasł. Poproś o nowy.
sk_sk: Tento overovací odkaz je neplatný alebo vypršal. Požiadajte o nový.

# Auth.RateLimit.TooManyAttempts
source: Too many attempts
cs_cz: Příliš mnoho pokusů
de_de: Zu viele Versuche
pl_pl: Zbyt wiele prób
sk_sk: Príliš veľa pokusov

# Auth.RateLimit.TooManyAttempts.Detail
source: Too many attempts. Please try again later.
cs_cz: Příliš mnoho pokusů. Zkuste to prosím později.
de_de: Zu viele Versuche. Bitte versuchen Sie es später erneut.
pl_pl: Zbyt wiele prób. Spróbuj ponownie później.
sk_sk: Príliš veľa pokusov. Skúste to neskôr.

# Common.Validation.Required
source: This field is required.
cs_cz: Toto pole je povinné.
de_de: Dieses Feld ist erforderlich.
pl_pl: To pole jest wymagane.
sk_sk: Toto pole je povinné.

# Common.Validation.InvalidRequest
source: One or more validation errors occurred.
cs_cz: Některé validační údaje nejsou správné.
de_de: Einige Validierungsfehler sind aufgetreten.
pl_pl: Wystąpiły błędy walidacji.
sk_sk: Niektoré validačné údaje sú neplatné.

# Common.Validation.CheckInput
source: Please check the submitted values and try again.
cs_cz: Zkontrolujte zadané hodnoty a zkuste to znovu.
de_de: Bitte prüfen Sie die eingegebenen Werte und versuchen Sie es erneut.
pl_pl: Sprawdź wprowadzone wartości i spróbuj ponownie.
sk_sk: Skontrolujte zadané hodnoty a skúste to znova.

# Account.Preferences.Language.Invalid
source: Unsupported language selection.
cs_cz: Nepodporovaný jazyk.
de_de: Nicht unterstützte Sprache.
pl_pl: Nieobsługiwany język.
sk_sk: Nepodporovaný jazyk.

# Account.Password.Updated
source: Password updated.
cs_cz: Heslo bylo změněno.
de_de: Passwort wurde aktualisiert.
pl_pl: Hasło zostało zaktualizowane.
sk_sk: Heslo bolo zmenené.

# Account.Email.Updated
source: Email updated.
cs_cz: E-mail byl změněn.
de_de: E-Mail wurde aktualisiert.
pl_pl: E-mail został zaktualizowany.
sk_sk: E-mail bol zmenený.

# Account.Sessions.Revoked
source: Other sessions were signed out.
cs_cz: Ostatní relace byly odhlášeny.
de_de: Andere Sitzungen wurden abgemeldet.
pl_pl: Pozostałe sesje zostały wylogowane.
sk_sk: Ostatné relácie boli odhlásené.

# Common.Error.Title
source: Operation failed
cs_cz: Operace selhala
de_de: Vorgang fehlgeschlagen
pl_pl: Operacja nie powiodła się
sk_sk: Operácia zlyhala

# Common.Error.Detail
source: The operation could not be completed.
cs_cz: Operaci se nepodařilo dokončit.
de_de: Der Vorgang konnte nicht abgeschlossen werden.
pl_pl: Nie udało się ukończyć operacji.
sk_sk: Operáciu nebolo možné dokončiť.

# Oidc.Authorize.InvalidRequest
source: The authorization request is invalid.
cs_cz: Autorizační požadavek je neplatný.
de_de: Die Autorisierungsanfrage ist ungültig.
pl_pl: Żądanie autoryzacji jest nieprawidłowe.
sk_sk: Autorizačná požiadavka je neplatná.

# Oidc.Token.InvalidRequest
source: The token request is invalid.
cs_cz: Token požadavek je neplatný.
de_de: Die Token-Anfrage ist ungültig.
pl_pl: Żądanie tokenu jest nieprawidłowe.
sk_sk: Požiadavka na token je neplatná.

# Oidc.Token.RefreshReused
source: The refresh token has already been used.
cs_cz: Obnovovací token už byl použit.
de_de: Das Refresh-Token wurde bereits verwendet.
pl_pl: Token odświeżania został już użyty.
sk_sk: Obnovovací token už bol použitý.

# Oidc.Token.RefreshExpired
source: The refresh token has expired.
cs_cz: Obnovovací token vypršel.
de_de: Das Refresh-Token ist abgelaufen.
pl_pl: Token odświeżania wygasł.
sk_sk: Obnovovací token vypršal.
